using System;
using System.Collections.Generic;
using System.Text;

namespace TerexCrawler.Models.Const
{
    public static class Aspects
    {
        public static List<string> mobile = new List<string>() {
            "موبایل#نوآوری",
            "موبایل#کیفیت_ساخت",
            "مویایل#عمومی",
            "موبایل#قیمت",
            "موبایل#قابلیت",
            "موبایل#طراحی",
            "موبایل#حافظه",
            "موبایل#پردازنده",
            "موبایل#متفرقه",

            "سیستم_عامل#عملکرد",
            "سیستم_عامل#بروزرسانی",
            "سیستم_عامل#نسخه",

            "باتری#کیفیت",
            "باتری#شارژ",

            "پشتیبانی#کیفیت", 

            "دوربین#سلفی",
            "دوربین#کیفیت",

            "برند#عمومی",
            "صفحه_نمایش#عمومی",
            "صفحه_نمایش#کیفیت",

            "خدمات#ارسال",
            "خدمات#عمومی",
            "خدمات#کمپین",
            "خدمات#گارانتی"};

        public static List<string> laptop = new List<string>() {
            "موبایل#نوآوری",
            "موبایل#کیفیت_ساخت",
            "مویایل#عمومی",
            "موبایل#قیمت",
            "موبایل#قابلیت",
            "موبایل#طراحی",
            "موبایل#حافظه",
            "موبایل#پردازنده",
            "موبایل#متفرقه",

            "سیستم_عامل#عملکرد",
            "سیستم_عامل#بروزرسانی",
            "سیستم_عامل#نسخه",

            "باتری#کیفیت",
            "باتری#شارژ",

            "پشتیبانی#کیفیت", 

            "دوربین#سلفی",
            "دوربین#کیفیت",

            "برند#عمومی",
            "صفحه_نمایش#عمومی",
            "صفحه_نمایش#کیفیت",

            "خدمات#ارسال",
            "خدمات#عمومی",
            "خدمات#کمپین",
            "خدمات#گارانتی"};
    }
}
